app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "title1"], ["body", "aaaaaa"], ["created_at", "2021-10-22 08:20:53.259745"], ["updated_at", "2021-10-22 08:20:53.259745"], ["user_id", "1"]]
SELECT "books".* FROM "books"

  def show
    @newbook = Book.new
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]